# 2.1 - Pandas Deepdive

### Importar un archivo

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_excel('../data/Online Retail.xlsx')

df.head()

,InvoiceNo,InvoiceDate,StockCode,Description,Quantity,UnitPrice,Revenue,CustomerID,Country
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom

In [3]:
# creación de columna con nulos

df['NullID']=[i if i%2 else None for i in range(len(df))]

df.head()

,InvoiceNo,InvoiceDate,StockCode,Description,Quantity,UnitPrice,Revenue,CustomerID,Country,NullID
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [4]:
# renombrar columnas

df.columns

Index(['InvoiceNo', 'InvoiceDate', 'StockCode', 'Description', 'Quantity',
       'UnitPrice', 'Revenue', 'CustomerID', 'Country', 'NullID'],
      dtype='object')

In [5]:
nuevas_cols=[c.lower() for c in df.columns]

nuevas_cols

['invoiceno',
 'invoicedate',
 'stockcode',
 'description',
 'quantity',
 'unitprice',
 'revenue',
 'customerid',
 'country',
 'nullid']

In [6]:
df=df.rename(columns={k:v for k,v in zip(df.columns, nuevas_cols)})  # k=viejas cols, v=nuevas cols

df.head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

### Descripción de los datos

In [7]:
df.shape

(396034, 10)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int64
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(3)
memory usage: 30.2+ MB

In [9]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int64
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(3)
memory usage: 93.7 MB

In [10]:
df.count()  # valores no nulos

invoiceno      396034
invoicedate    396034
stockcode      396034
description    396034
quantity       396034
unitprice      396034
revenue        396034
customerid     396034
country        396034
nullid         198017
dtype: int64

In [12]:
df.country.value_counts() # cuenta valores unicos en una columna

United Kingdom          353983
Germany                   8658
France                    8034
EIRE                      7136
Spain                     2422
Netherlands               2322
Belgium                   1935
Switzerland               1810
Portugal                  1425
Australia                 1181
Norway                    1048
Channel Islands            744
Italy                      741
Finland                    647
Cyprus                     612
Sweden                     428
Austria                    384
Denmark                    367
Poland                     325
Japan                      321
Israel                     248
Singapore                  215
Iceland                    182
USA                        179
Canada                     150
Greece                     142
Malta                      109
United Arab Emirates        67
South Africa                57
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              24
Bahrain                     17
Saudi Arabia                 9
Name: country, dtype: int64

In [14]:
df['country'].unique()  # valores unicos sin cuenta

array(['United Kingdom', 'Spain', 'Cyprus', 'EIRE', 'Portugal',
       'Netherlands', 'Australia', 'Singapore', 'Switzerland', 'Finland',
       'Channel Islands', 'France', 'Malta', 'Italy', 'Israel', 'Germany',
       'Austria', 'Norway', 'Denmark', 'Sweden', 'Belgium', 'Canada',
       'Poland', 'Japan', 'Iceland', 'Greece', 'Lebanon', 'South Africa',
       'Czech Republic', 'USA', 'Brazil', 'United Arab Emirates',
       'Lithuania', 'Saudi Arabia', 'Bahrain'], dtype=object)

In [15]:
# descripcion estadistica del dataframe

df.describe()

,invoiceno,quantity,unitprice,revenue,customerid,nullid
count,396034.000000,396034.000000,396034.000000,396034.000000,396034.000000,198017.000000
mean,560620.294401,12.624838,2.867826,21.492062,15302.695435,198017.000000
std,13110.655964,42.816911,4.265226,93.863439,1709.744925,114325.456929
min,536365.000000,1.000000,0.040000,0.060000,12347.000000,1.000000
25%,549198.500000,2.000000,1.250000,4.680000,13975.000000,99009.000000
50%,561894.000000,6.000000,1.950000,11.800000,15160.000000,198017.000000
75%,572095.000000,12.000000,3.750000,19.800000,16805.000000,297025.000000
max,581587.000000,4800.000000,649.500000,38970.000000,18287.000000,396033.000000

In [16]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
invoiceno,396034.0,560620.294401,13110.655964,536365.00,549198.50,561894.00,572095.00,581587.0
quantity,396034.0,12.624838,42.816911,1.00,2.00,6.00,12.00,4800.0
unitprice,396034.0,2.867826,4.265226,0.04,1.25,1.95,3.75,649.5
revenue,396034.0,21.492062,93.863439,0.06,4.68,11.80,19.80,38970.0
customerid,396034.0,15302.695435,1709.744925,12347.00,13975.00,15160.00,16805.00,18287.0
nullid,198017.0,198017.000000,114325.456929,1.00,99009.00,198017.00,297025.00,396033.0

In [17]:
df.describe().T['50%']   # mediana de todas las columnas numericas

invoiceno     561894.00
quantity           6.00
unitprice          1.95
revenue           11.80
customerid     15160.00
nullid        198017.00
Name: 50%, dtype: float64

### Selección dentro del dataframe

In [18]:
df[['quantity', 'unitprice']].head()  # seleccion de columnas por su nombre

   quantity  unitprice
0         6       2.55
1         6       2.55
2         6       2.55
3        64       2.55
4        32       2.55

In [20]:
df[df.quantity==6].head()   # seleccion con condicion, cantidad=6

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,5.0
8,536502,2010-12-01 12:36:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,16552,United Kingdom,NaN

In [23]:
df[(df.quantity==6) & (df.unitprice==2.55)].head()   # multicondicion, & and logico

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,5.0
15,536600,2010-12-02 08:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,15.0

In [26]:
df[(df.quantity==6) & ~(df.unitprice==2.55)].head() # ~virgulilla, no logico, lo contrario, cantidad=6, precio diferente de 2.55

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
8,536502,2010-12-01 12:36:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,16552,United Kingdom,NaN
13,536590,2010-12-01 16:52:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,13065,United Kingdom,13.0
14,536594,2010-12-01 17:22:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,15235,United Kingdom,NaN
17,536607,2010-12-02 09:29:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,17732,United Kingdom,17.0
32,536833,2010-12-02 17:48:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,18239,United Kingdom,NaN

In [27]:
df[(df.quantity==6) & (df.unitprice!=2.55)].head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
8,536502,2010-12-01 12:36:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,16552,United Kingdom,NaN
13,536590,2010-12-01 16:52:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,13065,United Kingdom,13.0
14,536594,2010-12-01 17:22:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,15235,United Kingdom,NaN
17,536607,2010-12-02 09:29:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,17732,United Kingdom,17.0
32,536833,2010-12-02 17:48:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,18239,United Kingdom,NaN

In [29]:
df[(df.quantity==6) | (df.country=='EIRE')].tail()  # | or logico

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
396015,580318,2011-12-02 15:38:59.999999,23561,SET OF 6 RIBBONS PARTY,6,2.89,17.34,17686,United Kingdom,396015.0
396016,580542,2011-12-05 09:04:00.000000,23561,SET OF 6 RIBBONS PARTY,6,2.89,17.34,15358,United Kingdom,NaN
396017,580544,2011-12-05 09:14:59.999999,23561,SET OF 6 RIBBONS PARTY,6,2.89,17.34,15156,United Kingdom,396017.0
396019,581021,2011-12-07 10:23:59.999999,23561,SET OF 6 RIBBONS PARTY,6,2.89,17.34,14769,United Kingdom,396019.0
396023,581581,2011-12-09 12:20:00.000000,23561,SET OF 6 RIBBONS PARTY,6,2.89,17.34,17581,United Kingdom,396023.0

In [30]:
df.iloc[0]   # seleccion por indice, primera fila

invoiceno                                  536365
invoicedate                   2010-12-01 08:26:00
stockcode                                  85123A
description    CREAM HANGING HEART T-LIGHT HOLDER
quantity                                        6
unitprice                                    2.55
revenue                                      15.3
customerid                                  17850
country                            United Kingdom
nullid                                        NaN
Name: 0, dtype: object

In [32]:
df.iloc[0:2]

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0

In [37]:
df.iloc[:2, 1:4]   # df.iloc[fila_ini:fila_final, col_inicial:col_final] por indice

          invoicedate stockcode                         description
0 2010-12-01 08:26:00    85123A  CREAM HANGING HEART T-LIGHT HOLDER
1 2010-12-01 09:02:00    85123A  CREAM HANGING HEART T-LIGHT HOLDER

In [38]:
df.loc[0:3]  # localiza por elemento

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0

In [41]:
df.loc[0:3, ['invoicedate', 'invoiceno']]   # df.loc[[index], [columnas]]

          invoicedate  invoiceno
0 2010-12-01 08:26:00     536365
1 2010-12-01 09:02:00     536373
2 2010-12-01 09:32:00     536375
3 2010-12-01 10:19:00     536390

In [42]:
df.sample(6)   # muestra aleatoria de 6 elementos

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
157197,545460,2011-03-02 17:33:00.000000,22697,GREEN REGENCY TEACUP AND SAUCER,1,2.95,2.95,13230,United Kingdom,157197.0
194084,537381,2010-12-06 13:13:00.000000,85038,6 CHOCOLATE LOVE HEART T-LIGHTS,6,2.10,12.60,14667,United Kingdom,NaN
385379,569359,2011-10-03 14:55:00.000000,23113,PANTRY CHOPPING BOARD,3,4.95,14.85,18257,United Kingdom,385379.0
126044,580963,2011-12-06 14:49:00.000000,22557,PLASTERS IN TIN VINTAGE PAISLEY,12,1.65,19.80,14868,United Kingdom,NaN
205852,553348,2011-05-16 13:19:59.999999,22440,BALLOON WATER BOMB PACK OF 35,20,0.42,8.40,14911,EIRE,NaN
341497,568908,2011-09-29 13:38:00.000000,23170,REGENCY TEA PLATE ROSES,12,1.65,19.80,16653,United Kingdom,341497.0

In [43]:
df.sample(frac=0.1).head()  # muestra aleatoria del 10%

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
64917,580262,2011-12-02 12:42:00,21891,TRADITIONAL WOODEN SKIPPING ROPE,12,1.45,17.40,16759,United Kingdom,64917.0
381198,575487,2011-11-09 17:11:00,23396,BUTTERFLY CUSHION COVER,4,3.75,15.00,15450,United Kingdom,NaN
395784,578993,2011-11-27 15:38:00,23498,CLASSIC BICYCLE CLIPS,1,1.45,1.45,15987,United Kingdom,NaN
342079,575337,2011-11-09 14:11:00,23084,RABBIT NIGHT LIGHT,1,2.08,2.08,17867,United Kingdom,342079.0
211577,538053,2010-12-09 13:34:00,20676,RED RETROSPOT BOWL,16,1.25,20.00,15856,United Kingdom,211577.0

In [44]:
df._get_numeric_data().head()   # solo las columnas numericas

   invoiceno  quantity  unitprice  revenue  customerid  nullid
0     536365         6       2.55     15.3       17850     NaN
1     536373         6       2.55     15.3       17850     1.0
2     536375         6       2.55     15.3       17850     NaN
3     536390        64       2.55    163.2       17511     3.0
4     536394        32       2.55     81.6       13408     NaN

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int64
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(3)
memory usage: 30.2+ MB

In [47]:
df.select_dtypes(include=['int64']).head()

   invoiceno  quantity  customerid
0     536365         6       17850
1     536373         6       17850
2     536375         6       17850
3     536390        64       17511
4     536394        32       13408

In [48]:
df.select_dtypes(include=['int64', 'float64'], exclude='datetime64[ns]').head()

   invoiceno  quantity  unitprice  revenue  customerid  nullid
0     536365         6       2.55     15.3       17850     NaN
1     536373         6       2.55     15.3       17850     1.0
2     536375         6       2.55     15.3       17850     NaN
3     536390        64       2.55    163.2       17511     3.0
4     536394        32       2.55     81.6       13408     NaN

### Cambio del tipo de datos

In [51]:
df.quantity.astype(dtype='int8')   # cambiar el tipo de dato

0          6
1          6
2          6
3         64
4         32
          ..
396029    12
396030    12
396031    12
396032    12
396033     1
Name: quantity, Length: 396034, dtype: int8

In [53]:
#OJO, para cambiar el tipo hay que sobreescribir la columna

df.quantity=df.quantity.astype(dtype='int8')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int8
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(2), int8(1), object(3)
memory usage: 27.6+ MB

### Manejo de valores nulos

In [55]:
df.isna().head()   # ¿es nulo?

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,False,False,False,False,False,False,False,False,False,True
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,True
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,True

In [56]:
df.notna().head()   # ¿es NO nulo?

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,True,True,True,True,True,True,True,True,True,False
1,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,False
3,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,False

In [58]:
nan_cols=df.isna().sum()

nan_cols[nan_cols>0]

nullid    198017
dtype: int64

**¿Qué hacemos?**

In [59]:
# podemos rellenar

df.fillna(0).head()   # rellena con un cero

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,0.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,0.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,0.0

In [60]:
df.fillna(df.nullid.mean()).head()   # rellena con la media

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,198017.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,198017.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,198017.0

In [61]:
df.fillna(df.nullid.median()).head()   # rellena con la mediana

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,198017.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,198017.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,198017.0

In [63]:
# podemos borrar la columna

df.drop('nullid', axis=1).head()    # borrar una columna

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom

In [64]:
df.drop(columns=['invoicedate', 'stockcode']).head()  # eliminar varias

,invoiceno,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [65]:
df.head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [66]:
# para no sobreescribir el original, copiarlo

df_2=df.copy()

In [68]:
# podemos borra registros

df[df.nullid.isna()].head()   # seleccionar donde nulos en columna nullid

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00.000000,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
2,536375,2010-12-01 09:32:00.000000,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
4,536394,2010-12-01 10:39:00.000000,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN
6,536401,2010-12-01 11:21:00.000001,85123A,CREAM HANGING HEART T-LIGHT HOLDER,4,2.95,11.8,15862,United Kingdom,NaN
8,536502,2010-12-01 12:36:00.000000,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.7,16552,United Kingdom,NaN

In [70]:
df.dropna().head()   # elimina nulos

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom,1.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.20,17511,United Kingdom,3.0
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom,5.0
7,536406,2010-12-01 11:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,8,2.55,20.40,17850,United Kingdom,7.0
9,536520,2010-12-01 12:43:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,3,2.95,8.85,14729,United Kingdom,9.0

In [71]:
# eliminar duplicados

df.drop_duplicates().head()   # si y solo si son exactamente iguales

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [74]:
df.drop_duplicates(subset=['country']).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00.000000,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom,NaN
103,538095,2010-12-09 14:55:00.000000,85123A,CREAM HANGING HEART T-LIGHT HOLDER,1,2.95,2.95,17097,Spain,103.0
147,538826,2010-12-14 12:58:00.000000,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.20,12370,Cyprus,147.0
179,539320,2010-12-16 19:16:00.000000,85123A,CREAM HANGING HEART T-LIGHT HOLDER,24,2.95,70.80,14911,EIRE,179.0
183,539353,2010-12-17 11:29:59.999999,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.70,12782,Portugal,183.0

### Agrupación

In [78]:
df.groupby('country').agg('sum').head()   # para agrupar es necesaria la funcion de agragacion

            invoiceno  quantity  unitprice    revenue  customerid       nullid
country
Australia   656866967   21692.0    3262.50  138171.31    14708852  116591145.0
Austria     216042887    3820.0    1145.90    8742.68     4808382   36538436.0
Bahrain       9397437     260.0      78.95     548.40      210027    1300214.0
Belgium    1084768176   22194.0    5887.85   36927.34    24054214  193310168.0
Brazil       17606432     356.0     142.60    1143.60      408608    2712644.0

In [80]:
df.groupby('country').agg({'quantity': 'sum', 'revenue': 'mean', 'customerid': 'count'}).head()

           quantity     revenue  customerid
country
Australia   21692.0  116.995182        1181
Austria      3820.0   22.767396         384
Bahrain       260.0   32.258824          17
Belgium     22194.0   19.083897        1935
Brazil        356.0   35.737500          32

### Pivot Table y Crosstab

In [89]:
df2=pd.read_csv('../data/student-por.csv', sep=';')

df2.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,4,0,11,11
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,2,9,11,11
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,6,12,13,12
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,0,14,14,14
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,0,11,13,13

In [91]:
pd.crosstab(index=df2.sex, columns=df2.famsize)  # cruce, el count

famsize  GT3  LE3
sex
F        284   99
M        173   93

In [93]:
df2.pivot_table(index=['school'],
                columns=['sex', 'studytime'],
                values=['G3'])

                  G3                                                         \
sex                F                                           M
studytime          1          2          3          4          1          2
school
GP         12.142857  12.904000  13.528302  14.235294  11.194805  12.469136
MS         10.340426  10.986301  12.136364  14.000000   9.586957  10.115385


sex
studytime          3      4
school
GP         13.666667  12.00
MS         13.250000   9.75

In [94]:
df2.pivot_table(index=['school'],
                columns=['sex', 'studytime'],
                values=['G3'],
                fill_value=0)   # por si tiene nan, la media por defecto

                  G3                                                         \
sex                F                                           M
studytime          1          2          3          4          1          2
school
GP         12.142857  12.904000  13.528302  14.235294  11.194805  12.469136
MS         10.340426  10.986301  12.136364  14.000000   9.586957  10.115385


sex
studytime          3      4
school
GP         13.666667  12.00
MS         13.250000   9.75

In [98]:
df2.pivot_table(index=['school'],
                columns=['sex', 'studytime'],
                values=['G3'],
                fill_value=0,
                aggfunc='sum')    # sumando

            G3
sex          F                    M
studytime    1     2    3    4    1     2    3    4
school
GP         510  1613  717  242  862  1010  246  120
MS         486   802  267   56  441   263   53   39

In [99]:
df2.pivot_table(index=['school'],
                columns=['sex', 'studytime'],
                values=['G3'],
                fill_value=0,
                aggfunc='count')   # contando

           G3
sex         F                M
studytime   1    2   3   4   1   2   3   4
school
GP         42  125  53  17  77  81  18  10
MS         47   73  22   4  46  26   4   4

### Aplicación de funciones

### Json Normalize, Explode

### Unión de dataframes

### Eval y query

### lookup

### index y reindex

### Multi index

### Exportar datos

### Métodos habituales de pandas

```python
df.head()                     # printea la cabeza, por defecto 5 filas
df.tail()                     # pritea la cola, por defecto 5 filas
df.describe()                 # descripcion estadistica
df.info()                     # informacion del df
df.info(memory_usage='deep')
df.columns                    # muestra columna
df.index                      # muestra indice
df.dtypes                     # muestra tipos de datos de las columnas
df.plot()                     # hace un grafico
df.hist()                     # hace un histograma
df.col.value_counts()         # cuenta los valores unicos de una columna
df.col.unique()               # muestra valores unicos de una columna
df.copy()                     # copia el df
df.drop()                     # elimina columnas o filas (axis=0,1)
df.dropna()                   # elimina nulos
df.fillna()                   # rellena nulos
df.shape                      # dimensiones del df
df._get_numeric_data()        # selecciona columnas numericas
df.rename()                   # renombre columnas
df.str.replace()              # reemplaza columnas de strings
df.astype(dtype='float32')    # cambia el tipo de dato
df.iloc[]                     # localiza por indice
df.loc[]                      # localiza por elemento
df.ix[]                       # loc+iloc
df.transpose()                # transpone el df
df.T
df.sample(n, frac)            # muestra del df
df.col.sum()                  # suma de una columna
df.col.max()                  # maximo de una columna
df.col.min()                  # minimo de una columna
df[col]                       # selecciona columna
df.col
df.isnull()                   # valores nulos
df.isna()
df.notna()                    # valores no nulos
df.drop_duplicates()          # eliminar duplicados
df.reset_index(inplace=True)  # resetea el indice y sobreescribe
```